# Print Method (View, Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..Print Method (View, Boolean)
View Class See Also
---
Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Print(
	View viewTemplate,
	bool useCurrentPrintSettings
)
```

Visual Basic
---
```text
Public Sub Print ( _
	viewTemplate As View, _
	useCurrentPrintSettings As Boolean _
)
```

Visual C++
---
```text
public:
void Print(
	View^ viewTemplate,
	bool useCurrentPrintSettings
)
```

# ### Parameters
viewTemplate
    Type: Autodesk.Revit.DB..::..ViewThe view template which apply to the view.
useCurrentPrintSettings
    Type: System..::..BooleanIf true, print the view with the print setting of the current active document; otherwise with the view's document's print setting.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the view cannot be printed. |

# See Also
View Class
Print Overload
Autodesk.Revit.DB Namespace